[
  {
    "position": "Full Stack Developer",
    "company": "ReferScout",
    "date": {
      "start": 1696540800000,
      "end": 1760428800000
    },
    "location": "Remote",
    "responsibilities": [
      "Maintained and enhanced a Ruby on Rails back-end application.",
      "Built and optimized a ReactJS front-end interface for seamless usability.",
      "Integrated APIs to ensure smooth data communication between front-end and back-end.",
      "Conducted code reviews and implemented best practices for scalability."
    ]
  },
  {
    "position": "Full Stack Developer",
    "company": "Resonate and Engage Marketing Inc.",
    "date": {
      "start": 1665964800000,
      "end": 1696464000000
    },
    "location": "Remote",
    "responsibilities": [
      "Maintained and expanded a Ruby on Rails project for marketing solutions.",
      "Migrated the system from a full-stack Rails app to a Rails + ReactJS hybrid.",
      "Added ApolloJS and GraphQL support to improve API efficiency and developer experience.",
      "Implemented front-end features using ReactJS, improving UI responsiveness."
    ]
  },
  {
    "position": "Software Engineer",
    "company": "OpsManager",
    "date": {
      "start": 1561334400000,
      "end": 1584086400000
    },
    "location": "Philippines",
    "responsibilities": [
      "Built new modules for the Inventory Management System using Ruby on Rails.",
      "Created custom dashboards to present thousands of data points as graphs and charts.",
      "Improved database queries to enhance system performance and reduce latency.",
      "Designed RESTful APIs for internal use and third-party integrations."
    ]
  },
  {
    "position": "Lead Designer",
    "company": "Talkpush",
    "date": {
      "start": 1489996800000,
      "end": 1553846400000
    },
    "location": "Philippines",
    "responsibilities": [
      "Designed and maintained Talkpush’s website with a focus on SEO and performance.",
      "Developed new features for the company's main application using Ruby on Rails.",
      "Implemented a modern UI on the front-end using ReactJS.",
      "Maintained Talkpush's website using Dokku."
    ]
  }
]
